Revit 2026 API

# ZoneEquipmentData Class

---

Represents the data and parameters of analytical zone equipment.

SystemObject Autodesk.Revit.DB.MechanicalZoneEquipmentData

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ZoneEquipmentData : IDisposable
```
```vb
Public Class ZoneEquipmentData
	Implements IDisposable
```
```cpp
public ref class ZoneEquipmentData : IDisposable
```
```fsharp
type ZoneEquipmentData =
    class
        interface IDisposable
    end
```

The ZoneEquipmentData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AirSystemId | The air system used for this zone equipment, if applicable. |
|  | ChilledWaterLoopId | The chilled water loop used for the chilled water option of cooling coil. |
|  | CondenserWaterLoopId | The condenser water loop used for the direction expansion water cooled option of cooling coil. |
|  | CoolingCoilType | The type of cooling coil. Note this property change would reset the chilled water loop. |
|  | EquipmentBehavior | The behavior of how zone equipment is allocated with assigned spaces. |
|  | EquipmentType | The type of zone equipment. Note this property would reset other properties. |
|  | HeatingCoilType | The type of heating coil. Note this property change would reset the hot water loop. |
|  | HotWaterLoopId | The water loop element id for the hot-water heating coil. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | VRFLoopId | The Varible Refrigerant Flow loop for the VRF fan coil equipment type. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ZoneEquipmentData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsDataCompleted | Is the required data completed for this zone equipment? |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace